Tekla Open API Reference for Tekla Structures 2025
PluginAttribute.Name Property
 The name of the plug-in in the system.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
PluginAttribute Class
Tekla.Structures.Plugins Namespace